<html>
    <head>
        <meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
        <link rel="stylesheet" href="./estilo.css" type="text/css">
        <title>Conceptos matem&aacute;ticos</title>
    </head>

    <body>
        <h1 class="ldi">Conceptos matem&aacute;ticos</h1>
        <h5 class="ldi">
            <a href="#primos">N&uacute;meros primos</a> |
            <a href="#aureos">N&uacute;meros aureos</a> |
            <a href="#fractales">N&uacute;meros fractales</a>
        </h5>
        <h2 class="ldi">N&uacute;meros primos<a name="primos"></a></h2>
        <h3 class="ldi">Definici&oacute;n</h3>
        <!--<p class="ldi"> -->
        <table>
            <tr>
                <td width=150><img src="img/primos.jpg" width="140" height="85" align="left"></td>
                <td>
                    <font size="2">Los n&uacute;meros primos, que llevan fascinando a los
                    matem&aacute;ticos desde su descubrimiento, se usan hoy como t&eacute;cnicas 
                    de cifrado (algo de lo que ya os hablamos). Imagina un n&uacute;mero
                    absurdamente grande, algo como:

                    3.527.075.438.238.295.822.083.471.097.193.579.384.912.841.084.
                    108.562.041.958.239

                    Ahora sup&oacute;n que este n&uacute;mero es el producto de dos n&uacute;meros primos,
                    y que solo descubri&eacute;ndolos tendr&aacute;s acceso a, por ejemplo, mi base
                    de datos. El c&aacute;lculo es extraordinariamente laborioso, incluso 
                    para un ordenador. Este sistema criptogr&aacute;fico se llama RSA y fue
                    empleado por Estados Unidos y Rusia durante la Guerra Fr&iacute;a.

                    El c&aacute;lculo de n&uacute;meros primos sigue siendo un reto matem&aacute;tico 
                    hoy en d&iacute;a. En  2013, un matem&aacute;tico estadounidense encontr&oacute; 
                    el n&uacute;mero primo m&aacute;s grandes calculado hasta ahora. Tiene 17 
                    millones de d&iacute;gitos, as&iacute; que entiende que no lo copiemos aqu&iacute;.
                    </font>
                </td>
            </tr>
        </table>
        <!-- </p>-->

        <h2 class="ldi">N&uacute;meros &aacute;ureos<a name="aureos"></a></h2>
        <h3 class="ldi">Definici&oacute;n</h3>
        <!--<p class="ldi">-->
        <table>
            <tr>
                <td width=150><img src="img/aureo.jpg" width="140" height="85" align="left"></td>
                <td>
                    <font size="2">Tambi&eacute;n llamado n&uacute;mero de oro, es un n&uacute;mero irracional
                    cuyo valor aproximado es 1’618033…

                    Se simboliza con la letra griega Fi (φ) y expresa la proporci&oacute;n
                    entre dos fragmentos de una recta. La proporci&oacute;n &aacute;urea se representa
                    con este rect&aacute;ngulo:

                    SimilarGoldenRectangles.svg

                    Este rect&aacute;ngulo respeta las proporci&oacute;n &aacute;urea. Si dibujas un cuadrado
                    a partir de su lado mas peque&ntilde;o (a) y lo eliminas, el rect&aacute;ngulo
                    resultante (coloreado en rosa) sigue respetando la proporci&oacute;n &aacute;urea.

                    Lo llamativo de esta proporci&oacute;n es que aparece en multitud de elementos
                    de la naturaleza; est&aacute; en los p&eacute;talos de las flores, en las hojas de
                    un tallo y en los caracoles.

                    Muchos artistas, fascinados por este misterioso n&uacute;mero, han reflejado
                    las proporciones &aacute;ureas en sus cuadros. Es el caso de Dal&iacute; y su 'Semitaza
                    gigante volante, con anexo inexplicable de cinco metros de longitud'.
                    </font>
                </td>
            </tr>
        </table>
        <!--</p>-->
        <h2 class="ldi">N&uacute;meros fractales<a name="fractales"></a></h2>
        <h3 class="ldi">Definici&oacute;n</h3>
        <!-- <p class="ldi">-->
        <table>
            <tr>
                <td width=150><img src="img/fractal.jpg" width="140" height="85" align="left"></td>
                <td>
                    <font size="2">Un fractal es un objeto cuya estructura se repite
                    a distintas escalas.

                    Fue formulado por el matem&aacute;tico Benoit Mandelbrot, conocido sobre
                    todo por su investigaci&oacute;n del llamado conjunto de Mandelbrot.

                    Existen (aproximaciones a) fractales en la naturaleza, como los
                    copos de nieve o las l&iacute;neas costeras. De hecho, fue precisamente
                    la costa de Gran Breta&ntilde;a la que emple&oacute; Mandelbrot en uno de sus
                    m&aacute;s populares art&iacute;culos sobre fractales, como ya contamos.


                    El matem&aacute;tico descubri&oacute; que el per&iacute;metro de Gran Breta&ntilde;a cambiaba
                    sustancialmente en funci&oacute;n de la unidad de medida elegida. Cuanto
                    m&aacute;s peque&ntilde;a era la escala de medida elegida, mayor era el per&iacute;metro
                    obtenido. Era como si el per&iacute;metro de Gran Breta&ntilde;a fuese infinito
                    (cosa que probablemente encant&oacute; a los pol&iacute;ticos de la &eacute;poca).

                    Hoy estamos bastante seguros de que Gran Breta&ntilde;a es finita,
                    pero este juego matem&aacute;tico sirvi&oacute; a Mandelbrot para afirmar
                    que existe un comportamiento fractal en las costas.
                    </font>
                </td>
            </tr>
        </table>
        <!-- </p>-->

    </body>
</html>